Fuentes/ficohsacore-osb-7e5cceccb837/Middleware/v2/BusinessServices/FPC/getFinancialACH12c/wsdl/getFinancialACH12c.wsdl

<wsdl:definitions name="consultaFinancierasACHPS" targetNamespace="http://www.ficohsa.com.hn/middleware.services/consultaFinancierasACHPS/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:cons="http://www.ficohsa.com.hn/middleware.services/consultaFinancierasACHTypes" xmlns:auth="http://www.ficohsa.com.hn/middleware.services/autType" xmlns:fic="http://www.ficohsa.com.hn/middleware.services/consultaFinancierasACHPS/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <wsdl:types>
    <xsd:schema>
      <xsd:import namespace="http://www.ficohsa.com.hn/middleware.services/autType" schemaLocation="../xsd/HeaderElements.xsd"/>
    </xsd:schema>
    <xsd:schema>
      <xsd:import namespace="http://www.ficohsa.com.hn/middleware.services/consultaFinancierasACHTypes" schemaLocation="../xsd/GetFinancialACHTypes.xsd"/>
    </xsd:schema>
  </wsdl:types>    
  <wsdl:message name="consultaFinancierasACHRequest">
    <wsdl:part element="cons:consultaFinancierasACH" name="parameters"/>
    <wsdl:part element="auth:RequestHeader" name="RequestHeader"/>
  </wsdl:message>
  <wsdl:message name="consultaFinancierasACHResponse">
    <wsdl:part element="cons:consultaFinancierasACHResponse" name="result"/>
    <wsdl:part element="auth:ResponseHeader" name="ResponseHeader"/>
  </wsdl:message>
  <wsdl:portType name="consultaFinancierasACHPS">
    <wsdl:operation name="consultaFinancierasACH" parameterOrder="parameters RequestHeader ResponseHeader">
      <wsdl:input message="fic:consultaFinancierasACHRequest"/>
      <wsdl:output message="fic:consultaFinancierasACHResponse"/>
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="consultaFinancierasACHPSSOAP" type="fic:consultaFinancierasACHPS">
    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="consultaFinancierasACH">
      <soap:operation soapAction="http://www.ficohsa.com.hn/middleware.services/consultaFinancierasACHPS"/>
      <wsdl:input>
        <soap:body parts="parameters" use="literal"/>
        <soap:header message="fic:consultaFinancierasACHRequest" part="RequestHeader" use="literal"/>
      </wsdl:input>
      <wsdl:output>
        <soap:body parts="result" use="literal"/>
        <soap:header message="fic:consultaFinancierasACHResponse" part="ResponseHeader" use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="consultaFinancierasACHPS">
    <wsdl:port binding="fic:consultaFinancierasACHPSSOAP" name="consultaFinancierasACHPSSOAP">
      <soap:address location="https://dynamoosbdev:8004/regional/pension/soap/getFinancialACH/v11g"/>
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>